
import { WordItem, SongItem } from './types';

export const RAW_WORDS: string[] = [
  "小鸡", "见面", "小象", "小羊", "小狗",
  "手", "拉拉手", "招招手", "皮球", "风",
  "大树", "小", "大", "火把", "尾巴", "水",
  "青蛙", "小河", "鸭子", "河马", "乌龟",
  "门", "水龙头", "幼儿园", "泡泡", "喷",
  "香皂", "干净", "毛巾", "洗", "车站",
  "汽车", "小猪", "兔子", "郊游", "月牙",
  "响", "门铃", "公园", "下棋", "太阳",
  "画画", "妈妈", "爸爸", "小猫", "朋友",
  "土", "仓鼠", "洞", "花", "低", "高",
  "奶奶", "长大", "哥哥", "爷爷", "妹妹",
  "爱心", "衣服", "头发"
];

export const APP_WORDS: WordItem[] = RAW_WORDS.map((w, idx) => ({
  id: `w-${idx}`,
  text: w,
  category: 'general'
}));

export const APP_SONGS: SongItem[] = [
  {
    id: 'r1',
    title: '娃娃的手',
    content: ['离得远，招招手，', '走近啦，握握手。', '一起来，牵牵手，', '做游戏，钩钩手。', '跳个舞，拍拍手。', '再见啦，挥挥手。', '我们都是好朋友，', '亲亲热热拉拉手。']
  },
  {
    id: 'r2',
    title: '小尾巴',
    content: ['大公鸡，花尾巴，', '走来走去像朵花. ', '小狐狸，红尾巴，', '跑来走去像火把。', '小肥猪，细尾巴，', '“哼哼”一声摇两下。', '小宝宝，追妈妈，', '要当妈妈小尾巴。']
  },
  {
    id: 'r3',
    title: '敲门',
    content: ['我一个人在家的时候，', '总想爸爸妈妈来敲门。', '我和爸爸在家的时候，', '总想妈妈来敲门。', '我和妈妈在家的时候，', '总想爸爸来敲门。', '我们都在家的时候，', '朋友总会来敲门。']
  },
  {
    id: 'r4',
    title: '风的家',
    content: ['大风没有家，', '它在找妈妈。', '大风大风别找了，', '我把门开开，', '你也有家了，', '进来呀!进来呀!', '你的家，在我家']
  },
  {
    id: 'r5',
    title: '妈妈',
    content: ['你给我洗脸，', '你给我梳头发，', '你给我换衣服，', '你是我的妈妈。', '我给洋娃娃洗脸，', '我给洋娃娃梳头发，', '我给洋娃娃换衣服，', '我是洋娃娃的妈妈。']
  },
  {
    id: 'r6',
    title: '唱歌',
    content: ['小鸡唱歌，叽叽叽。', '小狗唱歌，汪汪汪。', '小猫唱歌，喵喵喵。', '老虎唱歌，嗷嗷嗷。', '一会儿轻，一会儿响。', '一会儿高，一会儿低。', '只要大家在一起，', '大声小声，没关系。']
  },
  {
    id: 'r7',
    title: '淋浴',
    content: ['大白象，笑眯眯，', '它请大家洗淋浴。', '小兔子，小花鸡，', '小黄狗，小猫咪，', '洗呀洗，洗呀洗，', '长鼻子喷水像下雨。']
  },
  {
    id: 'r8',
    title: '打电话',
    content: ['月牙月牙下来吧，', '我想请你打电话。', '告诉天公公:', '我们明天去郊游，', '请别下雨呀!']
  }
];

export const COLORS = [
  'bg-red-400', 'bg-blue-400', 'bg-green-400', 'bg-yellow-400', 'bg-purple-400', 'bg-pink-400', 'bg-orange-400'
];
